app/views/items/index.html.erb

	let cart = [];
	addButtons.forEach(function (button) {
		button.addEventListener('click', function () {
			let itemId = button.parentElement.querySelector('[name=itemId]').getAttribute('value');
			let itemName = button.parentElement.querySelector('[name=name]').getAttribute('value');
			let itemDescription = button.parentElement.querySelector('[name=description]').getAttribute('value');
			let itemPrice = parseFloat( button.parentElement.querySelector('[name=price]').getAttribute('value') ).toFixed(2);
			let itemQuantity = parseInt( button.parentElement.querySelector('[name=quantity]').value );
			let item = {itemId: itemId, itemName: itemName, itemDescription: itemDescription, itemPrice: itemPrice, itemQuantity: itemQuantity};
			let itemExists = false;

			for (let i = 0; i<cart.length; i++) {
				if ( cart[i].itemId == itemId ) {
					console.log('sfsd');
					itemExists = true;
					cart[i].itemQuantity += itemQuantity;
					break;
				}
			}

			if (itemExists) {
				itemExists = false;
---
SELECT "items".* FROM "items"
SELECT COUNT(*) FROM "items"