app/controllers/items_controller.rb

	def index
		#@items = Item.all
		@items = Item.paginate(page: params[:page], per_page: 10)
---
SELECT "items".* FROM "items"
SELECT COUNT(*) FROM "items"